<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friends =[{'age':15,'job':'student'},
          {'age':25,'job':'developer'},
          {'age':30,'job':'teacher'}]
df =pd.DataFrame(friends,
                 index=['John','Jenny','Nate'],
                 columns = ['age','job'])

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

행 삭제

In [ ]:
df.drop(['John','Nate'])

       age        job
Jenny   25  developer

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

df를 지정된 행 삭제한 것으로 초기화

In [ ]:
df =df.drop(['John','Nate'])

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
df =pd.DataFrame(friends,
                 index=['John','Jenny','Nate'],
                 columns = ['age','job'])

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df.drop(['John','Nate'],inplace=True)

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
friends =[{'name':'John','age':15,'job':'student'},
          {'name':'Ben','age':25,'job':'developer'},
          {'name':'Jenny','age':30,'job':'teacher'}]
df =pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

인덱스 지정하여 행 삭제

In [ ]:
df=df.drop(df.index[[0,2]])

In [ ]:
df

  name  age        job
1  Ben   25  developer

In [ ]:
 df =pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

조건 지정하여 출력

In [ ]:
df = df[df.age>20]

In [ ]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
 df =pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

컬럼 삭제

In [ ]:
df = df.drop('age',axis =1)

In [ ]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [ ]:
 df =pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df.drop('age',axis =1,inplace =True)

In [ ]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher